class_work/First Routes & Controllers/first_routes/app/controllers/users_controller.rb

    def create
            user = User.new(user_params)
            # replace the `user_attributes_here` with the actual attribute keys
         if user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "michael4"], ["email", "random4"]]

    def destroy
        user=User.find(params[:id])
        user.destroy # calls rails own destroy function ?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]

    def update
        user=User.find(params[:id])

        success = user.update(self.user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "michael1"], ["email", "generic1"], ["id", 1]]